<?php
/*
$ceu = array("Италия" => "Рим", "Люксембург" => "Люксембург", "Бельгия" => "Брюссель", 
"Дания" => "Копенгаген", "Финляндия" => "Хельсинки", "Франция "=>"Париж", 
"Словакия"=>"Братислава", "Словения"=>"Любляна", "Германия"=>"Берлин",
"Греция"=>"Афины", "Ирландия" => "Дублин", "Нидерланды" => "Амстердам", 
"Португалия" => "Лиссабон", "Испания" => "Мадрид", "Швеция" => "Стокгольм", 
"Великобритания" => "Лондон", "Кипр"=>"Никосия", "Литва"=>"Вильнюс", "Чехия"=>"Прага", 
"Эстония"=>"Таллин"," Польша "=>"Варшава");
Создайте сценарий PHP, который отображает столицу и название страны из указанного выше массива $ceu. Отсортируйте список по названиям столиц.
Пример вывода:
Страна Нидерланды - столица Амстердам
Страна Греция - столица Афины
Страна Германии - столица Берлин
*/

$ceu = array("Италия" => "Рим", "Люксембург" => "Люксембург", 
            "Бельгия" => "Брюссель", 
            "Дания" => "Копенгаген", 
            "Финляндия" => "Хельсинки", 
            "Франция "=>"Париж", 
            "Словакия"=>"Братислава", 
            "Словения"=>"Любляна", 
            "Германия"=>"Берлин",
            "Греция"=>"Афины",  
            "Ирландия" => "Дублин", 
            "Нидерланды" => "Амстердам", 
            "Португалия" => "Лиссабон", 
            "Испания" => "Мадрид", 
            "Швеция" => "Стокгольм", 
            "Великобритания" => "Лондон", 
            "Кипр"=>"Никосия", 
            "Литва"=>"Вильнюс", 
            "Чехия"=>"Прага", 
            "Эстония"=>"Таллин",
            "Польша "=>"Варшава");
asort($ceu);
foreach($ceu as $country => $capital) {
echo "Cтолица $capital - Страна $country"."\n" ;
}
?>